Documents/ПринятиеКУчетуНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПринятиеКУчетуНМА</Name>
			<BasedOn>
				<xr:Item>Catalog.НематериальныеАктивы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.СчетаБухгалтерскогоУчетаНМА</xr:Item>
				<xr:Item>AccumulationRegister.ИПРБП</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.ИПМПЗ</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.НДСРаздельныйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ИППрочиеРасходы</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.СостоянияНМАОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ИПСведенияОбОплатеОСиНМА</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленныйРеализация0</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыНМАДляУСН</xr:Item>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияНМАНалоговыйУчетУСН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПринятияКУчетуНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовУчетаНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НематериальныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаВнеоборотногоАктива</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьАмортизациюБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользованияБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНачисленияАмортизацииБУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыДокументаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСписанияНИОКРНаРасходыНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСписанияНИОКРНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриобретения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьАмортизациюНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользованияНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальныйКоэффициентНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьУСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользованияУСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВключенияСтоимостиВСоставРасходовУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВключенияСтоимостиВСоставРасходовНУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВключенияСтоимостиОСВСоставРасходовНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходовПриВключенииВСтоимость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяПрочихРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНМА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяИнвестиционныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатаНМА</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПринятиеКУчетуНМА/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	ПорядокСписанияНИОКРНаРасходыНУ = ?(Дата < '20120101', Перечисления.ПорядокСписанияНИОКРНУ.Равномерно, 
	Перечисления.ПорядокСписанияНИОКРНУ.ПриПринятииКУчету);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.ПринятиеКУчетуНМА.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	УчетНМА.ПроверитьВозможностьИзмененияСостоянияНМА(
		ПараметрыПроведения.СостоянияНМА,
		ПараметрыПроведения.СостоянияНМА,
		Отказ);
	
		// Таблица включения в расходы при принятии к учету (НУ)
	ТаблицаЗатратПоВключениюСтоимостиВСоставРасходовНУ = УчетНМА.ПодготовитьТаблицуСписаниеНаРасходыНУ(
		ПараметрыПроведения.ПервоначальныеСведенияНМАНУ,
		ПараметрыПроведения.ВключениеВРасходыПриПринятииКУчетуНУ,
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПринятияКУчетуНМА = Документы.ПринятиеКУчетуНМА.ПодготовитьТаблицыПараметровПринятиеКУчетуНМА(
		ПараметрыПроведения.ПринятиеКУчетуНМА, ПараметрыПроведения.СпособОтраженияРасходов);
		
	// Учет доходов и расходов ИП
	ТаблицаПринятияКУчетуНМАИП	= УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПринятияКУчетуНМА(
		ПараметрыПроведения.ПервоначальныеСведенияНМАИП, ПараметрыПроведения.ПринятиеКУчетуНМА);
	
	ТаблицаВключенияСтоимостиНМАВСоставРасходовИП = 
		УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуВключенияСтоимостиНМАВСоставРасходовИП(
		ПараметрыПроведения.ПервоначальныеСведенияНМАИП, ПараметрыПроведения.ПринятиеКУчетуНМА);
	
	ТаблицаИнвестиционныйВычет = ИнвестиционныйНалоговыйВычет.ПодготовитьТаблицуИнвестиционныйВычетПринятиеКУчетуНМА(
		ПараметрыПроведения.ПринятиеКУчетуНМА);
		
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	// Алгоритмы формирования проводок этого документа рассчитывают суммы проводок налогового учета
	Движения.Хозрасчетный.ДополнительныеСвойства.Вставить("СуммыНалоговогоУчетаЗаполнены", Истина);

	УчетНМА.СформироватьДвиженияСостоянияНМАОрганизаций(ПараметрыПроведения.СостоянияНМА,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияПринятиеКУчетуНМА(
		ПараметрыПринятияКУчетуНМА.ТаблицаПринятияКУчетуНМА, ПараметрыПринятияКУчетуНМА.ТаблицаСписания,
		Движения, Отказ);

	УчетНМА.СформироватьДвиженияРегистрацияСчетовБухгалтерскогоУчетаНМА(
		ПараметрыПроведения.СчетаБухгалтерскогоУчетаНМА,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияИзменениеСпособовОтраженияРасходовПоАмортизацииНМАБУ(
		ПараметрыПроведения.СпособыОтраженияРасходовПоАмортизацииНМАБУ,
		Движения, Отказ);

	УчетНМА.СформироватьДвиженияРегистрацияПервоначальныхСведенийНМАБУ(
		ПараметрыПроведения.ПервоначальныеСведенияНМАБУ,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияРегистрацияПервоначальныхСведенийНМАНУ(
		ПараметрыПроведения.ПервоначальныеСведенияНМАНУ,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияРегистрацияПервоначальныхСведенийНМАУСН(
		ПараметрыПроведения.ТаблицаОплатНМАУСН,
		ПараметрыПроведения.ПервоначальныеСведенияНМАУСН,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияНачислениеАмортизацииНМАСпециальныйКоэффициентНУ(
		ПараметрыПроведения.НачислениеАмортизацииНМАСпециальныйКоэффициентНУ,
		Движения, Отказ);
	
	ИнвестиционныйНалоговыйВычет.СформироватьДвиженияИнвестиционныйВычетСтоимостьОбъектов(
		ТаблицаИнвестиционныйВычет,
		ПараметрыПроведения.ПринятиеКУчетуНМА,
		Движения);
		
	// Учет НДС
	УчетНДСРаздельный.СформироватьДвиженияПринятиеНаУчетНМА(
		ПараметрыПроведения.НМАНДС,
		ПараметрыПроведения.СписанныеНМАНДС,
		ТаблицаЗатратПоВключениюСтоимостиВСоставРасходовНУ,
		ПараметрыПроведения.РеквизитыНДС,
		Движения, Отказ);
		
	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПринятиеКУчетуНМА(
		ТаблицаПринятияКУчетуНМАИП,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
		
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВключенияСтоимостиНМАВСоставРасходовИП(
		ТаблицаВключенияСтоимостиНМАВСоставРасходовИП,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
		
	УчетДоходовИРасходовПредпринимателя.РегистрацияСведенийОбОплатеОСиНМА(
		ТаблицаПринятияКУчетуНМАИП,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	ПрименениеПБУ18            = УчетнаяПолитика.ПоддержкаПБУ18(Организация, Дата);
	РаздельныйУчетНДСНаСчете19 = УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата);
	ПлательщикНалогаНаПрибыль  = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Организация, Дата);
	ПлательщикНДФЛ             = УчетнаяПолитика.ПлательщикНДФЛ(Организация, Дата);
	
	Если ПрименениеПБУ18 Тогда
		Если СтоимостьНУ = 0 И СтоимостьПР = 0 И СтоимостьВР = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Поля ""Стоимость (НУ)"", ""Стоимость (ПР)"", ""Стоимость (ВР)"" не заполнены.
				|Хотя бы одно из этих полей должно быть заполнено.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СтоимостьНУ");
		КонецЕсли;
		МассивНепроверяемыхРеквизитов.Добавить("СтоимостьНУ");
	КонецЕсли;
	
	Если Не РаздельныйУчетНДСНаСчете19 
		Или ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ПринятиеКУчетуНаОснованииИнвентаризации Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособУчетаНДС");
	КонецЕсли;
	
	Если Не ПрименениеПБУ18 ИЛИ ВидОбъектаУчета = Перечисления.ВидыОбъектовУчетаНМА.НематериальныйАктив Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокСписанияНИОКРНаРасходыНУ");
	КонецЕсли;
	
	Если ВидОбъектаУчета <> Перечисления.ВидыОбъектовУчетаНМА.НематериальныйАктив Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетНачисленияАмортизации");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СпособОтраженияРасходовПриВключенииВСтоимость");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	Если Не НачислятьАмортизациюБУ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияБУ");
		МассивНепроверяемыхРеквизитов.Добавить("СпособНачисленияАмортизацииБУ");
	КонецЕсли;
	
	Если Не ПлательщикНалогаНаПрибыль И Не ПлательщикНДФЛ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
	КонецЕсли;
	
	Если Не ПлательщикНалогаНаПрибыль Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособОтраженияРасходовПриВключенииВСтоимость");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если Не ПлательщикНДФЛ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	Если Не ПорядокВключенияСтоимостиВСоставРасходовНУ = 
		Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СпособОтраженияРасходовПриВключенииВСтоимость");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
		
	КонецЕсли;
	
	Если ВидОбъектаУчета = Перечисления.ВидыОбъектовУчетаНМА.НематериальныйАктив 
		И Не ПорядокВключенияСтоимостиВСоставРасходовНУ 
		= Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если ВидОбъектаУчета = Перечисления.ВидыОбъектовУчетаНМА.РасходыНаНИОКР 
		И Не ПорядокСписанияНИОКРНаРасходыНУ = Перечисления.ПорядокСписанияНИОКРНУ.Равномерно Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если Не НачислятьАмортизациюНУ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПринятияКУчетуНМА.ПринятиеКУчетуНаОснованииИнвентаризации Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаВнеоборотногоАктива");
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийПринятияКУчетуНМА.ПринятиеКУчетуНаОснованииИнвентаризации Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяДоходов");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СрокПолезногоИспользованияНУ = ?(НачислятьАмортизациюНУ, СрокПолезногоИспользованияНУ,0);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоОснованию(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.НематериальныеАктивы") Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ЭтоГруппа") = Истина Тогда
			Возврат;
		КонецЕсли;
		
		НематериальныйАктив = Основание;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
